tutorial/LES/CAJF28/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    //solver          ode;
    solver          OptSeulex;
    //solver          OptRosenbrock34;
    //solver          OptRodas34;
    method          FastChemistryModel;
}

chemistry       on;

initialChemicalTimeStep 1e-07;
jacobian        exact;

balance         on;
odeCoeffs
{
    solver          Rosenbrock34;
    absTol          1e-08;
    relTol          1e-4;
}
OptRosenbrock34Coeffs
{

    absTol          1e-8;
    relTol          1e-4;
}
OptRodas34Coeffs
{

    absTol          1e-8;
    relTol          1e-4;
}
OptSeulexCoeffs
{

    absTol          1e-8;
    relTol          1e-4;
}
#include        "reactions"
