tutorial/LES/CAJF28/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.24 0 0);

boundaryField
{
    inlet-1
    {
        type            decayingTurbulenceInflowGeneratorMod;
        direction       1;
        value           nonuniform List<vector> 
2560
(
(10.2174 0.0177071 -0.00953532)
(10.3159 0.0171128 -0.011103)
(10.3687 0.0164092 -0.0118595)
(10.4193 0.0157673 -0.0124555)
(10.46 0.0150567 -0.012479)
(10.5049 0.0145556 -0.0119722)
(10.5615 0.013982 -0.0111169)
(10.5844 0.013327 -0.00982176)
...
)
;
        R               nonuniform List<symmTensor> 
2560
(
(0.415713 0.123351 -0.125949 0.261006 0.0449595 0.260881)
(0.413049 0.118172 -0.12895 0.262823 0.0447781 0.257226)
(0.409879 0.112219 -0.131446 0.264094 0.0441059 0.252785)
(0.406456 0.10606 -0.133862 0.265465 0.0434015 0.24857)
(0.403203 0.0999162 -0.136086 0.267134 0.0424282 0.245145)
(0.399778 0.0936589 -0.138307 0.268884 0.0412517 0.241655)
(0.396502 0.0871328 -0.140742 0.27058 0.0398249 0.237861)
(0.393404 0.0804413 -0.143046 0.272424 0.0381004 0.234068)
...
)
;
        ind             2;
    }
    inlet-2
    {
        type            fixedValue;
        value           uniform (0.24 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    wall-1
    {
        type            noSlip;
    }
}


// ************************************************************************* //
