tutorial/LES/CAJF28/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         cellLimited leastSquares 1;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss LUST grad(U)  1;
    div(phi,Yi)         Gauss limitedLinear01 1;
    div(phi,h)          Gauss limitedLinear 1;
    div(phi,K)          Gauss limitedLinear 1;
    div(phid,p)         Gauss limitedLinear 1;
    div(phi,epsilon)    Gauss limitedLinear 1;
    div(phi,Yi_h)       Gauss limitedLinear01 1;
    div(phi,k)          Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;

}

laplacianSchemes
{
    default                    Gauss linear limited 0.5;
/*    laplacian(rhorAUf,p)       Gauss linear corrected;*/
}

interpolationSchemes
{
    default         linear;    
}

snGradSchemes
{
    default         limited 0.5;
}



// ************************************************************************* //
